W9D2/ArtShareAPI/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      comments = user.authored_comments
    else
      artwork = Artwork.find(params[:artwork_id])