W9D2/ArtShareAPI/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:query]
      query = "%#{params[:query].split("").join("%")}%"
      users = User.where("username ILIKE ?", query)
    else
      users = User.all