W10D4/reddit_on_rails/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "my first comment"], ["author_id", 2], ["post_id", 3], ["created_at", "2019-09-05 23:34:03.943148"], ["updated_at", "2019-09-05 23:34:03.943148"]]