W10D4/reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Bad sub title"], ["content", "santoheisnath      \r\n    "], ["sub_id", 1], ["author_id", 2], ["created_at", "2019-09-05 21:42:07.163084"], ["updated_at", "2019-09-05 21:42:07.163084"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "I like to purr!!!!!!!!!"], ["content", "      riiiiiiight      \r\n    \r\n    "], ["updated_at", "2019-09-05 22:03:33.647082"], ["id", 2]]

  def require_author!
     @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]