W10D4/reddit_on_rails/app/controllers/subs_controller.rb

UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Meow meow meowwwww"], ["updated_at", "2019-09-06 00:08:46.937139"], ["id", 1]]
---
  def update

    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_moderator!
    @sub = Sub.find_by(id: params[:id])