W10D4/reddit_on_rails/app/views/posts/edit.html.erb

      value="<%= sub.id %>"
      <%= "checked" if @post.sub_ids.include?(sub.id) %>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]