W9D5/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "year", "live?", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Fat the Cat"], ["year", 2006], ["live?", true], ["band_id", 5], ["created_at", "2019-08-31 00:15:42.273567"], ["updated_at", "2019-08-31 00:15:42.273567"]]

  def show
    @album = Album.find_by(id: params[:id])
    @band = Band.find_by(id: @album.band_id)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @album = Album.find_by(id: params[:id])

    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "live?" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["year", 1995], ["live?", true], ["updated_at", "2019-08-30 22:23:49.259084"], ["id", 2]]

  def destroy
    @album = Album.find_by(id: params[:id])
    if @album
      flash[:success] = "Album successfully removed!"
      @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]