W9D5/music_app/app/controllers/bands_controller.rb

  def create
    @band = Band.create(band_params)
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cat's Meow"], ["created_at", "2019-08-31 00:14:44.882955"], ["updated_at", "2019-08-31 00:14:44.882955"]]

  def destroy
    @band = Band.find_by(id: params[:id])
    if @band
      flash[:success] = "Band successfully removed!"
      @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]