W9D5/music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @track = Track.new
    @track.album_id = params[:album_id]
    @band = Album.find_by(id: params[:album_id]).band

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "bonus?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @track = Track.new(track_params)
    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "Hey heeeey"], ["updated_at", "2019-08-30 23:29:12.506911"], ["id", 2]]
---
  def update
    @track = Track.find_by(id: params[:id])

    if @track.update(track_params)